gap> START_TEST("JordanNormalform");

##These test the cyclic decomposition
gap> A := [ [ Z(5), Z(5)^3, Z(5), 0*Z(5), Z(5)^3, Z(5)^3 ], 
>   [ Z(5)^0, 0*Z(5), Z(5)^2, 0*Z(5), Z(5)^0, Z(5)^0 ], 
>   [ Z(5)^3, Z(5)^3, Z(5)^0, 0*Z(5), Z(5)^3, Z(5)^3 ], 
>   [ 0*Z(5), 0*Z(5), 0*Z(5), Z(5)^2, 0*Z(5), 0*Z(5) ], 
>   [ Z(5)^3, Z(5)^3, Z(5), 0*Z(5), Z(5), Z(5)^3 ], 
>   [ Z(5)^0, Z(5)^0, Z(5)^2, 0*Z(5), Z(5)^0, 0*Z(5) ] ];;
gap> Aconj := A^PseudoRandom(GL(6,5));;
gap> A^Inverse(JordanNormalform(A)) = Aconj^Inverse(JordanNormalform(Aconj));
true
gap> A := [ [ Z(5)^2, Z(5)^0, Z(5)^0, Z(5), 0*Z(5), Z(5), Z(5)^2, Z(5), Z(5)^3, Z(5)^2,
       Z(5)^3, Z(5)^3, Z(5)^0, Z(5)^3, 0*Z(5), Z(5), Z(5), 0*Z(5), Z(5)^3,
       Z(5)^3, Z(5), Z(5)^2, Z(5)^3, Z(5), Z(5)^3 ], 
  [ Z(5)^2, Z(5)^2, Z(5)^3, Z(5), Z(5)^0, Z(5)^2, Z(5)^2, Z(5)^3, Z(5), Z(5),
       0*Z(5), Z(5), Z(5)^3, Z(5)^0, Z(5)^2, Z(5)^2, Z(5)^3, Z(5)^0, Z(5)^3,
       Z(5), Z(5)^0, 0*Z(5), 0*Z(5), Z(5)^3, Z(5)^3 ], 
  [ 0*Z(5), Z(5)^0, Z(5)^0, Z(5), Z(5)^2, Z(5), Z(5)^3, 0*Z(5), Z(5)^0,
       Z(5)^3, Z(5), Z(5), Z(5)^3, Z(5), Z(5)^2, Z(5)^2, 0*Z(5), Z(5)^0,
       Z(5)^0, 0*Z(5), 0*Z(5), Z(5)^0, 0*Z(5), Z(5)^0, 0*Z(5) ], 
  [ Z(5), Z(5), Z(5), Z(5), Z(5)^3, Z(5), Z(5)^3, Z(5)^3, Z(5)^3, Z(5)^3,
       Z(5), 0*Z(5), Z(5)^2, 0*Z(5), Z(5), Z(5)^0, Z(5)^0, Z(5)^0, Z(5)^3,
       0*Z(5), Z(5)^2, Z(5), Z(5)^2, Z(5), Z(5) ], 
  [ Z(5)^2, Z(5), Z(5)^2, Z(5), Z(5)^0, Z(5)^0, Z(5)^3, Z(5), 0*Z(5), Z(5),
       Z(5), Z(5)^3, Z(5), Z(5)^2, 0*Z(5), Z(5)^2, Z(5)^2, Z(5)^3, Z(5)^0,
       Z(5)^3, Z(5), 0*Z(5), Z(5)^3, Z(5), 0*Z(5) ], 
  [ Z(5), Z(5), Z(5), Z(5), Z(5)^2, Z(5)^2, Z(5), Z(5)^3, Z(5), Z(5), Z(5),
       0*Z(5), Z(5)^2, Z(5), 0*Z(5), Z(5), Z(5)^2, Z(5)^3, 0*Z(5), Z(5),
       Z(5)^2, 0*Z(5), Z(5)^0, Z(5)^2, Z(5)^0 ], 
  [ 0*Z(5), Z(5)^2, Z(5), Z(5)^2, 0*Z(5), Z(5), Z(5)^0, Z(5)^0, Z(5)^0,
       Z(5)^2, Z(5)^3, Z(5)^0, Z(5)^0, Z(5)^3, Z(5), Z(5), Z(5)^2, Z(5)^2,
       Z(5)^0, Z(5)^3, Z(5)^0, Z(5)^0, Z(5)^2, Z(5), Z(5)^0 ], 
  [ Z(5)^2, Z(5)^0, Z(5), Z(5), Z(5)^2, 0*Z(5), Z(5)^0, Z(5), Z(5)^2, Z(5)^3,
       Z(5), Z(5)^2, Z(5), Z(5)^2, 0*Z(5), Z(5), 0*Z(5), Z(5)^3, Z(5)^3,
       Z(5)^2, Z(5), Z(5), Z(5)^3, Z(5)^3, Z(5)^2 ], 
  [ Z(5)^0, Z(5)^2, Z(5), Z(5)^3, Z(5)^0, Z(5), Z(5)^0, Z(5)^3, Z(5)^0,
       Z(5)^3, 0*Z(5), Z(5)^3, Z(5)^3, Z(5)^0, Z(5)^0, Z(5)^3, Z(5), Z(5)^0,
       Z(5)^0, Z(5), Z(5), Z(5)^0, Z(5)^0, Z(5)^0, Z(5)^2 ], 
  [ Z(5), Z(5)^0, Z(5)^0, Z(5)^3, 0*Z(5), Z(5)^2, Z(5)^0, Z(5)^0, Z(5)^0,
       Z(5)^3, Z(5), Z(5)^3, Z(5)^3, Z(5), Z(5)^2, 0*Z(5), 0*Z(5), Z(5)^3,
       Z(5), Z(5)^3, Z(5)^2, Z(5)^3, Z(5)^2, Z(5)^0, Z(5) ], 
  [ Z(5)^3, Z(5)^2, Z(5)^0, Z(5)^0, Z(5)^0, Z(5)^3, Z(5)^3, 0*Z(5), Z(5)^3,
       Z(5)^0, Z(5)^3, 0*Z(5), 0*Z(5), Z(5)^2, Z(5)^0, Z(5), Z(5), Z(5)^3,
       Z(5)^3, 0*Z(5), 0*Z(5), Z(5)^2, 0*Z(5), Z(5)^0, Z(5)^3 ], 
  [ Z(5), Z(5)^2, Z(5)^3, Z(5)^3, Z(5)^0, Z(5)^3, Z(5)^2, Z(5)^0, Z(5)^3,
       Z(5)^2, 0*Z(5), Z(5)^0, 0*Z(5), Z(5)^3, Z(5)^3, Z(5)^2, 0*Z(5), Z(5),
       Z(5), Z(5)^2, Z(5), 0*Z(5), Z(5), Z(5)^0, 0*Z(5) ], 
  [ Z(5)^3, 0*Z(5), 0*Z(5), Z(5)^2, Z(5)^0, Z(5)^3, Z(5)^2, Z(5)^2, Z(5)^0,
       0*Z(5), Z(5)^0, Z(5)^0, Z(5), Z(5), Z(5)^0, 0*Z(5), Z(5)^2, Z(5)^3,
       Z(5)^2, Z(5)^0, Z(5), Z(5)^0, Z(5)^3, Z(5), Z(5)^0 ], 
  [ Z(5)^3, Z(5)^3, Z(5)^2, Z(5)^3, Z(5)^0, 0*Z(5), Z(5)^2, Z(5)^0, Z(5)^3,
       Z(5), Z(5), Z(5)^3, 0*Z(5), Z(5)^0, 0*Z(5), Z(5)^0, Z(5)^2, Z(5)^3,
       Z(5)^3, Z(5)^3, Z(5), Z(5), 0*Z(5), Z(5)^2, Z(5) ], 
  [ Z(5), Z(5)^0, Z(5)^0, Z(5)^0, Z(5), Z(5), Z(5)^0, 0*Z(5), Z(5)^3, Z(5)^3,
       Z(5)^0, Z(5)^2, Z(5)^0, Z(5), Z(5), 0*Z(5), 0*Z(5), 0*Z(5), Z(5)^2,
       Z(5)^3, Z(5), Z(5)^0, Z(5)^2, Z(5)^2, Z(5)^2 ], 
  [ Z(5)^2, Z(5)^3, 0*Z(5), Z(5), Z(5)^3, Z(5)^0, 0*Z(5), Z(5), Z(5)^0,
       Z(5)^3, 0*Z(5), Z(5)^0, Z(5)^2, 0*Z(5), Z(5)^0, 0*Z(5), 0*Z(5), 0*Z(5),
      Z(5), Z(5), Z(5), Z(5), 0*Z(5), Z(5)^3, Z(5) ], 
  [ Z(5)^0, Z(5)^3, 0*Z(5), Z(5)^0, Z(5), 0*Z(5), Z(5)^0, Z(5)^3, Z(5)^2,
       Z(5)^3, Z(5)^3, Z(5), Z(5), Z(5), Z(5)^2, Z(5), 0*Z(5), Z(5)^2, 0*Z(5),
      Z(5)^3, Z(5)^3, Z(5), Z(5)^2, Z(5)^0, Z(5)^2 ], 
  [ 0*Z(5), Z(5), Z(5), 0*Z(5), Z(5)^3, Z(5)^2, Z(5)^2, Z(5)^0, Z(5), Z(5),
       0*Z(5), Z(5)^3, Z(5)^0, Z(5)^0, Z(5)^3, Z(5)^0, 0*Z(5), Z(5)^3, Z(5)^0,
      Z(5), 0*Z(5), Z(5), Z(5), Z(5), 0*Z(5) ], 
  [ Z(5), Z(5)^3, 0*Z(5), Z(5)^0, Z(5)^0, Z(5)^0, Z(5)^3, Z(5), Z(5)^3,
       Z(5)^3, 0*Z(5), 0*Z(5), Z(5), Z(5)^0, Z(5)^0, Z(5)^2, 0*Z(5), Z(5),
       Z(5)^0, Z(5)^2, Z(5)^2, Z(5)^3, Z(5), Z(5)^0, Z(5)^3 ], 
  [ Z(5)^2, Z(5)^2, Z(5)^3, Z(5)^3, Z(5)^2, Z(5)^2, 0*Z(5), Z(5)^2, Z(5)^2,
       0*Z(5), Z(5)^3, Z(5)^2, Z(5)^0, Z(5)^0, Z(5)^2, Z(5)^0, 0*Z(5), Z(5)^3,
      Z(5), Z(5)^2, 0*Z(5), 0*Z(5), Z(5)^0, Z(5)^0, Z(5)^2 ], 
  [ Z(5)^2, 0*Z(5), Z(5), Z(5)^2, 0*Z(5), Z(5)^2, Z(5), Z(5)^2, Z(5), Z(5)^0,
       Z(5)^0, 0*Z(5), Z(5)^3, Z(5)^2, 0*Z(5), Z(5)^0, Z(5)^3, Z(5), 0*Z(5),
       Z(5)^3, 0*Z(5), 0*Z(5), Z(5)^0, Z(5)^2, Z(5)^3 ], 
  [ Z(5)^0, Z(5)^0, Z(5), Z(5)^2, Z(5)^2, Z(5)^2, Z(5)^3, 0*Z(5), Z(5)^0,
       Z(5)^0, Z(5)^3, Z(5)^2, Z(5)^3, Z(5)^3, Z(5)^0, 0*Z(5), Z(5)^0, Z(5),
       0*Z(5), Z(5)^3, 0*Z(5), Z(5)^0, Z(5)^2, 0*Z(5), 0*Z(5) ], 
  [ 0*Z(5), Z(5)^2, Z(5)^3, 0*Z(5), Z(5), Z(5)^3, Z(5)^0, Z(5)^0, Z(5)^2,
       Z(5)^2, Z(5)^0, Z(5), Z(5)^0, Z(5)^2, 0*Z(5), 0*Z(5), Z(5)^0, Z(5)^0,
       Z(5)^2, 0*Z(5), Z(5)^2, Z(5)^2, 0*Z(5), Z(5)^0, 0*Z(5) ], 
  [ Z(5), Z(5)^2, Z(5)^2, Z(5), Z(5)^3, Z(5), Z(5)^0, Z(5)^2, Z(5)^3, Z(5)^2,
       0*Z(5), Z(5)^0, 0*Z(5), Z(5)^3, Z(5), 0*Z(5), Z(5)^3, Z(5)^2, Z(5)^3,
       Z(5), 0*Z(5), 0*Z(5), Z(5)^0, Z(5)^0, 0*Z(5) ], 
  [ 0*Z(5), 0*Z(5), Z(5)^0, Z(5)^0, Z(5)^2, Z(5)^2, 0*Z(5), Z(5)^2, Z(5)^0,
       Z(5)^0, Z(5)^3, Z(5)^2, 0*Z(5), Z(5), 0*Z(5), Z(5)^2, 0*Z(5), Z(5)^0,
       Z(5)^3, Z(5)^0, Z(5)^0, Z(5)^3, Z(5)^2, Z(5)^3, Z(5)^0 ] ];;
gap> Aconj := A^PseudoRandom(GL(25,5));;
gap> A^Inverse(JordanNormalform(A)) = Aconj^Inverse(JordanNormalform(Aconj));
true
gap> A := [ [ Z(5)^3, Z(5^2)^5, Z(5^2)^7, Z(5^2)^15, Z(5^2)^17, Z(5^2)^5, Z(5^2)^10,
       Z(5^2), Z(5^2)^9, Z(5^2)^4, Z(5^2)^21, Z(5)^2, Z(5^2)^20, Z(5^2)^23,
       Z(5^2)^21, Z(5^2)^8, Z(5)^3, Z(5^2)^9, Z(5^2)^7, Z(5^2)^9, Z(5^2)^19,
       Z(5^2)^4, Z(5^2)^16, Z(5^2)^11, Z(5)^2 ], 
  [ Z(5^2)^7, Z(5^2)^19, Z(5^2)^10, Z(5^2)^8, Z(5^2), Z(5^2)^3, Z(5^2)^22,
       Z(5^2)^15, Z(5)^3, Z(5^2)^21, 0*Z(5), Z(5^2)^14, Z(5)^3, Z(5^2)^7,
       Z(5^2)^4, 0*Z(5), Z(5^2)^10, Z(5^2)^7, Z(5^2)^7, Z(5^2)^8, Z(5),
       Z(5^2)^17, Z(5^2)^20, Z(5^2)^5, Z(5^2)^13 ], 
  [ Z(5^2)^21, Z(5^2)^16, Z(5)^3, Z(5)^3, Z(5^2)^19, Z(5^2)^8, Z(5^2)^8,
       Z(5^2)^9, 0*Z(5), Z(5^2)^20, Z(5^2)^20, Z(5^2)^14, Z(5^2)^7, Z(5^2)^13,
      Z(5^2)^10, Z(5^2)^20, Z(5^2)^8, Z(5^2)^19, Z(5^2)^20, Z(5^2)^3,
       Z(5^2)^13, Z(5), Z(5)^3, Z(5^2)^4, Z(5^2)^22 ], 
  [ 0*Z(5), Z(5^2)^14, Z(5^2)^5, Z(5^2)^2, Z(5^2)^4, Z(5^2)^8, Z(5^2)^16,
       Z(5^2)^8, Z(5^2)^13, Z(5^2)^20, Z(5^2), Z(5^2)^4, Z(5)^3, Z(5^2)^11,
       Z(5^2)^10, Z(5^2)^4, Z(5^2)^15, Z(5^2)^9, Z(5)^2, Z(5^2)^11, Z(5)^3,
       Z(5^2)^3, Z(5^2)^15, Z(5^2)^9, Z(5^2)^4 ], 
  [ Z(5^2), Z(5)^0, Z(5^2)^16, Z(5^2)^4, Z(5^2)^19, Z(5^2)^9, Z(5^2)^21,
       Z(5^2)^11, Z(5^2)^11, Z(5)^3, Z(5^2)^4, Z(5^2)^21, Z(5^2)^16, Z(5^2)^5,
      Z(5^2)^17, Z(5^2)^11, Z(5^2)^11, Z(5)^2, Z(5^2)^7, Z(5^2)^11, Z(5^2)^15,
      Z(5^2)^13, 0*Z(5), Z(5), Z(5)^0 ], 
  [ Z(5^2)^2, Z(5^2)^2, Z(5^2)^9, Z(5), Z(5^2)^10, Z(5^2)^3, Z(5^2)^20,
       Z(5^2)^9, 0*Z(5), Z(5^2)^5, Z(5)^3, Z(5^2)^3, Z(5^2)^4, Z(5^2)^5,
       Z(5^2)^5, Z(5)^3, Z(5^2)^10, Z(5^2)^20, Z(5^2)^10, Z(5^2)^9, Z(5)^0,
       Z(5^2)^15, Z(5^2)^23, Z(5^2)^4, Z(5)^3 ], 
  [ Z(5), Z(5^2)^11, Z(5^2)^3, Z(5^2)^8, Z(5^2)^23, Z(5^2)^5, Z(5^2),
       Z(5^2)^15, Z(5^2)^14, Z(5), Z(5^2)^19, Z(5^2)^21, Z(5^2)^19, Z(5^2)^9,
       Z(5^2)^21, Z(5^2)^16, Z(5^2)^8, Z(5)^3, Z(5^2)^17, Z(5^2)^5, Z(5),
       Z(5^2)^3, Z(5^2)^23, Z(5^2)^3, Z(5^2)^10 ], 
  [ Z(5^2)^7, Z(5^2)^7, Z(5^2)^16, Z(5^2)^8, Z(5^2)^5, Z(5^2)^16, 0*Z(5),
       Z(5^2)^3, Z(5^2)^14, Z(5^2)^11, Z(5)^3, Z(5^2)^10, 0*Z(5), Z(5)^0,
       Z(5)^3, Z(5)^0, Z(5)^0, Z(5^2)^2, Z(5^2)^4, Z(5^2)^22, Z(5^2)^9,
       Z(5^2)^20, Z(5)^0, Z(5^2)^10, Z(5) ], 
  [ Z(5^2)^22, Z(5^2)^5, Z(5^2)^15, Z(5^2)^11, Z(5^2)^22, Z(5^2)^15, Z(5)^2,
       Z(5^2)^7, Z(5^2)^13, Z(5^2)^10, Z(5^2)^22, Z(5^2)^4, Z(5)^2, Z(5^2)^19,
      Z(5^2)^20, Z(5^2)^14, Z(5^2)^23, Z(5^2)^7, Z(5)^3, Z(5^2)^21, Z(5^2)^2,
       Z(5^2)^16, Z(5^2)^17, Z(5)^2, Z(5^2)^11 ], 
  [ Z(5^2)^17, Z(5^2)^15, Z(5^2)^22, Z(5^2)^7, Z(5^2)^4, Z(5^2)^16, Z(5^2)^23,
      Z(5^2)^16, Z(5^2)^16, Z(5^2)^16, Z(5^2)^11, Z(5)^0, Z(5)^2, Z(5^2)^21,
       Z(5)^0, Z(5^2)^16, Z(5^2)^11, Z(5^2)^9, Z(5^2)^7, Z(5^2)^5, Z(5^2)^11,
       Z(5^2)^16, Z(5^2)^2, Z(5^2)^19, Z(5^2)^11 ], 
  [ Z(5^2)^7, Z(5^2)^10, 0*Z(5), Z(5^2)^7, Z(5^2)^5, Z(5^2)^9, Z(5^2)^22,
       Z(5^2)^20, Z(5)^2, Z(5^2)^13, Z(5^2)^4, Z(5^2)^22, Z(5^2)^21,
       Z(5^2)^13, Z(5^2)^14, Z(5^2)^7, Z(5^2)^8, Z(5^2)^10, Z(5^2)^16,
       Z(5^2)^5, Z(5^2)^3, Z(5)^0, Z(5^2)^8, Z(5^2)^7, Z(5)^2 ], 
  [ Z(5^2)^11, Z(5^2)^23, Z(5^2)^5, Z(5)^2, Z(5^2)^21, Z(5), Z(5^2)^11,
       Z(5^2)^15, Z(5^2)^19, Z(5)^0, Z(5^2)^2, Z(5), Z(5^2)^16, 0*Z(5),
       Z(5^2)^21, Z(5^2)^16, Z(5^2)^17, Z(5), Z(5^2)^17, Z(5), Z(5^2)^13,
       Z(5^2)^19, Z(5^2)^23, Z(5^2)^8, Z(5^2)^2 ], 
  [ Z(5), Z(5^2)^3, Z(5^2)^20, Z(5^2)^19, Z(5^2)^10, 0*Z(5), Z(5), Z(5^2)^10,
       Z(5^2)^9, Z(5^2)^9, Z(5^2)^19, Z(5)^2, Z(5), Z(5^2)^8, Z(5)^3, Z(5),
       Z(5^2)^20, Z(5^2)^9, Z(5^2)^11, Z(5^2)^23, Z(5^2)^2, Z(5^2)^8,
       Z(5^2)^7, Z(5^2)^7, Z(5^2)^19 ], 
  [ Z(5^2)^21, Z(5^2)^16, Z(5^2)^17, Z(5^2)^17, Z(5), Z(5^2)^5, Z(5^2)^21,
       Z(5^2)^21, Z(5^2)^11, Z(5)^2, 0*Z(5), Z(5), Z(5), Z(5^2)^13, Z(5)^3,
       Z(5)^2, Z(5^2)^2, Z(5^2)^11, 0*Z(5), Z(5^2)^14, Z(5), Z(5^2)^11,
       Z(5^2)^17, Z(5^2), Z(5^2)^19 ], 
  [ Z(5^2)^15, Z(5)^0, 0*Z(5), Z(5^2)^11, Z(5)^2, Z(5^2)^11, Z(5^2)^23,
       Z(5^2)^21, Z(5^2)^7, Z(5)^0, Z(5^2)^2, Z(5^2)^14, Z(5), 0*Z(5),
       Z(5^2)^9, Z(5^2)^10, Z(5^2)^17, Z(5^2)^10, Z(5^2)^3, Z(5^2)^14,
       Z(5^2)^15, 0*Z(5), Z(5^2)^16, Z(5^2)^15, Z(5^2) ], 
  [ Z(5)^3, Z(5)^2, Z(5)^2, Z(5)^2, Z(5)^3, Z(5)^3, Z(5^2)^21, 0*Z(5),
       Z(5^2)^8, Z(5^2)^16, Z(5)^0, Z(5^2)^13, Z(5^2)^5, Z(5^2)^16, Z(5),
       Z(5^2)^13, Z(5^2)^9, Z(5^2)^20, Z(5^2)^7, Z(5^2)^19, Z(5^2)^17,
       Z(5^2)^17, Z(5^2)^7, Z(5^2)^4, Z(5^2)^4 ], 
  [ Z(5^2)^15, Z(5^2)^17, Z(5^2)^8, Z(5^2)^13, Z(5^2)^17, Z(5^2)^4, Z(5^2)^20,
      Z(5^2)^15, Z(5^2)^15, Z(5^2)^7, Z(5^2)^11, Z(5^2)^5, Z(5^2)^21,
       Z(5^2)^2, Z(5^2)^19, Z(5^2), Z(5^2)^10, Z(5^2)^8, Z(5^2), Z(5^2)^20,
       Z(5)^3, Z(5^2)^9, Z(5^2)^15, Z(5^2)^13, Z(5^2)^3 ], 
  [ Z(5^2)^7, Z(5)^2, Z(5^2)^16, Z(5^2), Z(5^2)^22, Z(5^2)^20, Z(5^2)^2,
       Z(5^2)^23, Z(5^2)^7, Z(5^2)^19, Z(5^2)^5, Z(5^2)^22, Z(5^2)^23,
       Z(5^2)^2, Z(5^2)^22, Z(5^2)^20, Z(5)^3, Z(5^2)^19, Z(5^2)^22,
       Z(5^2)^19, 0*Z(5), Z(5^2)^13, Z(5^2), Z(5^2)^3, Z(5^2)^15 ], 
  [ Z(5^2)^2, Z(5^2)^8, Z(5^2)^9, Z(5^2)^23, Z(5^2)^3, Z(5^2)^8, Z(5^2)^2,
       Z(5^2)^7, Z(5^2)^22, Z(5^2)^21, Z(5^2)^8, Z(5^2)^2, Z(5^2)^5,
       Z(5^2)^13, Z(5^2)^8, Z(5^2)^21, Z(5^2)^14, Z(5), Z(5^2)^11, Z(5)^3,
       Z(5^2)^16, Z(5)^3, Z(5), Z(5^2)^16, Z(5^2)^9 ], 
  [ Z(5)^3, Z(5^2)^8, Z(5^2)^11, Z(5^2)^23, Z(5^2)^20, Z(5^2)^3, Z(5^2)^23,
       Z(5^2)^2, Z(5^2)^13, Z(5), Z(5^2)^7, Z(5^2)^9, Z(5^2)^7, Z(5^2),
       Z(5^2)^13, Z(5^2)^23, Z(5^2)^11, Z(5^2)^3, Z(5^2)^8, Z(5^2)^21,
       Z(5^2)^21, Z(5)^3, Z(5), Z(5^2)^21, Z(5^2)^11 ], 
  [ 0*Z(5), Z(5^2)^2, Z(5^2)^20, Z(5^2)^11, Z(5^2)^13, Z(5^2)^19, Z(5^2)^8,
       Z(5^2)^14, Z(5^2)^14, Z(5^2)^21, Z(5)^2, Z(5^2)^17, Z(5^2), Z(5),
       Z(5^2)^19, Z(5^2)^13, Z(5^2)^9, Z(5^2)^9, Z(5^2)^8, Z(5^2)^13,
       Z(5^2)^2, Z(5^2)^4, Z(5^2)^10, Z(5^2)^17, Z(5^2)^2 ], 
  [ Z(5^2)^8, Z(5)^3, Z(5^2)^21, Z(5^2)^11, Z(5^2)^7, Z(5^2)^22, Z(5^2)^7,
       Z(5^2)^3, Z(5^2)^23, Z(5^2)^13, Z(5^2)^14, Z(5^2)^11, Z(5^2)^3,
       Z(5^2)^21, Z(5^2)^19, Z(5^2)^13, Z(5^2)^23, Z(5^2)^14, Z(5^2)^15,
       Z(5^2)^15, Z(5^2)^2, Z(5)^0, Z(5^2)^2, Z(5^2)^17, Z(5^2)^10 ], 
  [ Z(5^2)^10, Z(5^2)^14, Z(5^2)^7, Z(5^2)^4, Z(5^2)^2, Z(5^2)^2, Z(5^2)^20,
       Z(5), Z(5^2)^3, Z(5^2)^14, Z(5^2)^13, 0*Z(5), Z(5^2)^20, Z(5^2)^9,
       Z(5^2)^15, Z(5^2)^20, Z(5^2)^13, Z(5^2)^11, Z(5)^2, Z(5^2)^11,
       Z(5^2)^14, Z(5^2)^22, Z(5^2)^2, Z(5^2)^10, Z(5^2)^4 ], 
  [ Z(5^2)^19, Z(5), Z(5)^0, Z(5^2)^9, Z(5^2)^14, Z(5)^2, Z(5^2)^20, Z(5^2),
       Z(5^2)^14, Z(5)^2, Z(5^2)^20, Z(5^2)^22, Z(5^2)^22, Z(5)^2, Z(5^2)^8,
       Z(5^2)^17, Z(5^2)^8, Z(5^2)^15, Z(5^2)^2, Z(5^2)^17, Z(5^2)^16,
       Z(5^2)^23, Z(5^2)^13, Z(5^2)^9, Z(5) ], 
  [ Z(5^2)^22, Z(5^2)^14, Z(5^2)^20, Z(5^2)^16, Z(5^2)^17, Z(5^2)^7,
       Z(5^2)^19, Z(5^2)^15, Z(5)^2, Z(5^2)^14, Z(5^2)^4, Z(5^2)^14, Z(5^2)^2,
      0*Z(5), Z(5^2)^2, Z(5)^2, Z(5^2)^13, Z(5^2)^8, Z(5)^2, Z(5^2)^19,
       Z(5^2), Z(5^2), Z(5^2)^20, Z(5)^2, Z(5) ] ];;
gap> Aconj := A^PseudoRandom(GL(25,5^5));;
gap> A^Inverse(JordanNormalform(A)) = Aconj^Inverse(JordanNormalform(Aconj));
true

##A few randomised tests
gap> A := RandomInvertibleMat(50,GF(5));;
gap> Aconj := A^RandomInvertibleMat(50,GF(5));;
gap> A^Inverse(JordanNormalform(A)) = Aconj^Inverse(JordanNormalform(Aconj));
true
gap> A := RandomInvertibleMat(25,GF(25));;
gap> Aconj := A^RandomInvertibleMat(25,GF(25));;
gap> A^Inverse(JordanNormalform(A)) = Aconj^Inverse(JordanNormalform(Aconj));
true
gap> A := RandomInvertibleMat(150,GF(7));;
gap> Aconj := A^RandomInvertibleMat(150,GF(7));;
gap> A^Inverse(JordanNormalform(A)) = Aconj^Inverse(JordanNormalform(Aconj));
true







